Repository: zkelo/FolderDock
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ru, uk

# ManagerIntro.Text
source: Add a folder to get a shortcut. Right-click it in the list → "Pin to taskbar". Clicking the icon opens the folder contents in a popup.
ru: Добавь папку — получишь ярлык. Закрепи его на панели задач (ПКМ → «Закрепить на панели задач»). Клик по значку откроет содержимое папки во всплывающем окне.
uk: Додай папку — отримаєш ярлик. ПКМ по рядку в списку → «Закріпити на панелі завдань». Клік по значку відкриє вміст папки у спливному вікні.

# AddFolderLabel.Text
source: Add folder
ru: Добавить папку
uk: Додати папку

# CheckUpdatesLabel.Text
source: Check for updates
ru: Проверить обновления
uk: Перевірити оновлення

# AutoUpdateLabel.Text
source: Check automatically
ru: Проверять автоматически
uk: Перевіряти автоматично

# RevealShortcutButton.Content
source: Show shortcut
ru: Показать ярлык
uk: Показати ярлик

# Dialog_ShortcutCreatedTitle
source: Shortcut created
ru: Ярлык создан
uk: Ярлик створено

# Dialog_ShortcutCreatedBody
source: Right-click the folder in the list → "Pin to taskbar". After pinning, clicking the icon opens the folder as a popup.
ru: В открывшемся Проводнике: ПКМ по ярлыку → «Показать дополнительные параметры» → «Закрепить на панели задач». После закрепления клик по значку откроет папку каскадом.
uk: ПКМ по папці в списку → «Закріпити на панелі завдань». Після закріплення клік по значку відкриє папку каскадом.

# Dialog_ErrorTitle
source: Error
ru: Ошибка
uk: Помилка

# Build_Label
source: Build: {0}
ru: Сборка: {0}
uk: Збірка: {0}

# Tooltip_Back
source: Back
ru: Назад
uk: Назад

# Tooltip_ViewToggle
source: Grid / list
ru: Сетка / список
uk: Сітка / список

# Tooltip_OpenInExplorer
source: Open in Explorer
ru: Открыть в Проводнике
uk: Відкрити у Провіднику

# Folder_Empty
source: Folder is empty
ru: Папка пуста
uk: Папка порожня

# Folder_AccessDenied
source: Folder is not accessible
ru: Нет доступа к папке
uk: Немає доступу до папки

# Share_NoItem
source: Nothing to share
ru: Нет элемента для отправки
uk: Немає елемента для надсилання

# Items_Count
source: Items: {0}
ru: Элементы: {0}
uk: Елементи: {0}

# Drive_Name
source: Drive {0}
ru: Диск {0}
uk: Диск {0}

# Exe_PathError
source: Could not determine the executable path
ru: Не удалось определить путь к исполняемому файлу
uk: Не вдалося визначити шлях до виконуваного файлу

# Update_Checking
source: Checking for updates…
ru: Проверка обновлений…
uk: Перевірка оновлень…

# Update_UpToDateStatus
source: You have the latest version (v{0})
ru: Установлена последняя версия (v{0})
uk: Встановлено останню версію (v{0})

# Update_UpToDateDialog
source: You are up to date — v{0}.
ru: У вас последняя версия — v{0}.
uk: У вас остання версія — v{0}.

# Update_CheckTitle
source: Update check
ru: Проверка обновлений
uk: Перевірка оновлень

# Update_AvailableStatus
source: Version v{0} is available
ru: Доступна версия v{0}
uk: Доступна версія v{0}

# Update_DialogTitle
source: Update available
ru: Доступно обновление
uk: Доступне оновлення

# Update_DialogBody
source: Version v{0} is out (you have v{1}). Download and install? The app will restart.
ru: Вышла версия v{0} (у вас v{1}). Скачать и установить? Приложение будет перезапущено.
uk: Вийшла версія v{0} (у вас v{1}). Завантажити та встановити? Застосунок буде перезапущено.

# Update_Now
source: Update
ru: Обновить
uk: Оновити

# Update_Later
source: Later
ru: Позже
uk: Пізніше

# Update_Downloading
source: Downloading v{0}…
ru: Скачивание v{0}…
uk: Завантаження v{0}…

# Update_Installing
source: Installing…
ru: Установка запущена…
uk: Встановлення запущено…

# Update_DownloadFailed
source: Failed to download the update
ru: Не удалось скачать обновление
uk: Не вдалося завантажити оновлення

# Update_ErrorTitle
source: Update error
ru: Ошибка обновления
uk: Помилка оновлення

# UpdateErr_BadTag
source: Unrecognized release tag: "{0}"
ru: Непонятный тег релиза: «{0}»
uk: Незрозумілий тег релізу: «{0}»

# UpdateErr_BadCurrent
source: Unrecognized current version: "{0}"
ru: Непонятная текущая версия: «{0}»
uk: Незрозуміла поточна версія: «{0}»

# UpdateErr_NoInstaller
source: Release {0} has no installer for {1}
ru: В релизе {0} нет установщика для {1}
uk: У релізі {0} немає інсталятора для {1}

# UpdateErr_Network
source: Could not check for updates: {0}
ru: Не удалось проверить обновления: {0}
uk: Не вдалося перевірити оновлення: {0}
